In [188]:
import pandas as pd
import numpy as np

## Preparing and Loading the Data

In [166]:
app = pd.read_csv('average-property-price.csv')

In [167]:
loc_codes = pd.read_csv('location-codes.csv')

In [168]:
display(app)
loc_codes.head()

,Date,Area,Code,Detached,Semi,Terraced,Flat
0,01/09/2016,Hartlepool,E06000001,179323.3934,108357.4457,77192.90613,62078.20672
1,01/10/2016,Hartlepool,E06000001,178880.9745,107765.1346,76294.05974,61893.84174
2,01/11/2016,Hartlepool,E06000001,179855.0608,107886.9468,76066.73993,61909.33647
3,01/12/2016,Hartlepool,E06000001,182847.8194,109312.3743,77019.16134,62919.44401
4,01/01/2017,Hartlepool,E06000001,177454.1433,105828.3642,74522.27530,60770.80795
...,...,...,...,...,...,...,...
5755,01/04/2019,South West,E12000009,392886.0520,257833.8176,211378.14160,164580.13010
5756,01/05/2019,South West,E12000009,391955.4811,257312.3992,210797.91220,163699.89930
5757,01/06/2019,South West,E12000009,395661.8630,259252.6985,211065.78130,165268.33830
5758,01/07/2019,South West,E12000009,403181.9431,263254.4633,215997.91970,166733.18990
5759,01/08/2019,South West,E12000009,410245.0874,265712.1510,217012.44280,165435.65370

  AuthorityCode         AuthorityName RegionCode  RegionName
0     E06000001            Hartlepool  E12000001  North East
1     E06000002         Middlesbrough  E12000001  North East
2     E06000003  Redcar and Cleveland  E12000001  North East
3     E06000004      Stockton-on-Tees  E12000001  North East
4     E06000005            Darlington  E12000001  North East

### Separating the Region from Area

In [169]:
region_data = app[app.Code.str[0:3] == 'E12'].copy()
region_data

,Date,Area,Code,Detached,Semi,Terraced,Flat
5436,01/09/2016,North East,E12000001,208117.1739,125683.3380,101385.68860,89361.51412
5437,01/10/2016,North East,E12000001,208519.1158,125464.3201,99998.54363,89716.48508
5438,01/11/2016,North East,E12000001,210555.4948,126082.1090,100433.81080,90065.71739
5439,01/12/2016,North East,E12000001,211728.7243,127186.0647,102150.75450,91195.50119
5440,01/01/2017,North East,E12000001,205942.7099,123088.4533,98112.30132,88170.43214
...,...,...,...,...,...,...,...
5755,01/04/2019,South West,E12000009,392886.0520,257833.8176,211378.14160,164580.13010
5756,01/05/2019,South West,E12000009,391955.4811,257312.3992,210797.91220,163699.89930
5757,01/06/2019,South West,E12000009,395661.8630,259252.6985,211065.78130,165268.33830
5758,01/07/2019,South West,E12000009,403181.9431,263254.4633,215997.91970,166733.18990
5759,01/08/2019,South West,E12000009,410245.0874,265712.1510,217012.44280,165435.65370

### Assigning each Area Record the Corresponding Region Code

In [170]:
app2 = app.merge(loc_codes,left_on='Code',right_on='AuthorityCode').copy()
app2 = app2.drop(columns=['AuthorityCode','AuthorityName','RegionName'],axis=1)
app2

,Date,Area,Code,Detached,Semi,Terraced,Flat,RegionCode
0,01/09/2016,Hartlepool,E06000001,179323.3934,108357.4457,77192.90613,62078.20672,E12000001
1,01/10/2016,Hartlepool,E06000001,178880.9745,107765.1346,76294.05974,61893.84174,E12000001
2,01/11/2016,Hartlepool,E06000001,179855.0608,107886.9468,76066.73993,61909.33647,E12000001
3,01/12/2016,Hartlepool,E06000001,182847.8194,109312.3743,77019.16134,62919.44401,E12000001
4,01/01/2017,Hartlepool,E06000001,177454.1433,105828.3642,74522.27530,60770.80795,E12000001
...,...,...,...,...,...,...,...,...
5431,01/04/2019,Worcestershire,E10000034,367609.8101,223579.8115,175790.42090,129009.66830,E12000005
5432,01/05/2019,Worcestershire,E10000034,365271.8235,222863.2382,175373.24490,128117.93010,E12000005
5433,01/06/2019,Worcestershire,E10000034,369772.6445,225435.2225,177094.03750,129593.06920,E12000005
5434,01/07/2019,Worcestershire,E10000034,371129.2027,225763.4806,177371.34880,129684.34220,E12000005
5435,01/08/2019,Worcestershire,E10000034,375018.4716,227014.1308,178440.82590,129242.39630,E12000005

Maybe comment on the fact that both dataframes have different lengths and numbers of names

In [171]:
print(len(app.Area.unique()))

160

In [172]:
print(len(loc_codes.AuthorityName.unique()))

153

In [173]:
# for x in app.Area.unique():
#     if x not in loc_codes.AuthorityName.unique():
#         print(x)

### Checking for missing data
The dataframe has a number of missing values from Detached, Semi and Terraced but only in the Area of City of London. All the values for Detached and Semi are missing so we cannot find a summary statistic for these values. As Terraced does have 16 actual values, I have found the median of these and replaced the null values.

In [174]:
app2.isnull().sum()

Date           0
Area           0
Code           0
Detached      36
Semi          36
Terraced      20
Flat           0
RegionCode     0
dtype: int64

In [175]:
app2[app2.Detached.isnull()].head()

,Date,Area,Code,Detached,Semi,Terraced,Flat,RegionCode
3276,01/09/2016,City of London,E09000001,NaN,NaN,1189233.714,777891.9778,E12000007
3277,01/10/2016,City of London,E09000001,NaN,NaN,1195010.116,790055.2118,E12000007
3278,01/11/2016,City of London,E09000001,NaN,NaN,1229507.612,815992.8991,E12000007
3279,01/12/2016,City of London,E09000001,NaN,NaN,1217012.801,809149.8515,E12000007
3280,01/01/2017,City of London,E09000001,NaN,NaN,1227434.570,817654.0898,E12000007

In [211]:
app2_terrace = app2.groupby('Area')['Terraced'].median()
app2_semi = app2.groupby('Area')['Semi'].median()
app2_detach = app2.groupby('Area')['Detached'].median()
app_medians = pd.concat([app2_terrace,app2_semi,app2_detach],axis=1)
app_medians = app_medians.reset_index()
print('Median value for Terraced in City of London = ' + str(app_medians.Terraced[app_medians.Area == 'City of London'].values))

Median value for Terraced in City of London = [1232198.045]

In [182]:
app2.Terraced = app2.Terraced.fillna(1232198.045)
app2[app2.Area == 'City of London']

,Date,Area,Code,Detached,Semi,Terraced,Flat,RegionCode
3276,01/09/2016,City of London,E09000001,NaN,NaN,1189233.714,777891.9778,E12000007
3277,01/10/2016,City of London,E09000001,NaN,NaN,1195010.116,790055.2118,E12000007
3278,01/11/2016,City of London,E09000001,NaN,NaN,1229507.612,815992.8991,E12000007
3279,01/12/2016,City of London,E09000001,NaN,NaN,1217012.801,809149.8515,E12000007
3280,01/01/2017,City of London,E09000001,NaN,NaN,1227434.570,817654.0898,E12000007
3281,01/02/2017,City of London,E09000001,NaN,NaN,1189660.065,818093.5200,E12000007
3282,01/03/2017,City of London,E09000001,NaN,NaN,1176573.144,851416.0699,E12000007
3283,01/04/2017,City of London,E09000001,NaN,NaN,1238739.417,903551.8492,E12000007
3284,01/05/2017,City of London,E09000001,NaN,NaN,1277795.874,937307.4240,E12000007
3285,01/06/2017,City of London,E09000001,NaN,NaN,1174213.336,928316.5022,E12000007
3286,01/07/2017,City of London,E09000001,NaN,NaN,1371818.926,852499.6103,E12000007
3287,01/08/2017,City of London,E09000001,NaN,NaN,1329083.749,845129.9177,E12000007
3288,01/09/2017,City of London,E09000001,NaN,NaN,1492447.140,834409.3919,E12000007
3289,01/10/2017,City of London,E09000001,NaN,NaN,1272233.494,816190.3133,E12000007
3290,01/11/2017,City of London,E09000001,NaN,NaN,1234888.478,787920.7440,E12000007
3291,01/12/2017,City of London,E09000001,NaN,NaN,1321238.147,775721.9336,E12000007
3292,01/01/2018,City of London,E09000001,NaN,NaN,1232198.045,799677.2254,E12000007
3293,01/02/2018,City of London,E09000001,NaN,NaN,1232198.045,780669.1239,E12000007
3294,01/03/2018,City of London,E09000001,NaN,NaN,1232198.045,738167.2469,E12000007
3295,01/04/2018,City of London,E09000001,NaN,NaN,1232198.045,729692.0505,E12000007
3296,01/05/2018,City of London,E09000001,NaN,NaN,1232198.045,793436.4292,E12000007
3297,01/06/2018,City of London,E09000001,NaN,NaN,1232198.045,786369.6628,E12000007
3298,01/07/2018,City of London,E09000001,NaN,NaN,1232198.045,806727.1693,E12000007
3299,01/08/2018,City of London,E09000001,NaN,NaN,1232198.045,781319.3840,E12000007
3300,01/09/2018,City of London,E09000001,NaN,NaN,1232198.045,798566.3705,E12000007
3301,01/10/2018,City of London,E09000001,NaN,NaN,1232198.045,800482.3905,E12000007
3302,01/11/2018,City of London,E09000001,NaN,NaN,1232198.045,762276.8651,E12000007
3303,01/12/2018,City of London,E09000001,NaN,NaN,1232198.045,808981.2189,E12000007
3304,01/01/2019,City of London,E09000001,NaN,NaN,1232198.045,863214.7838,E12000007
3305,01/02/2019,City of London,E09000001,NaN,NaN,1232198.045,897966.5433,E12000007
3306,01/03/2019,City of London,E09000001,NaN,NaN,1232198.045,856729.0349,E12000007
3307,01/04/2019,City of London,E09000001,NaN,NaN,1232198.045,741966.3606,E12000007
3308,01/05/2019,City of London,E09000001,NaN,NaN,1232198.045,736162.6548,E12000007
3309,01/06/2019,City of London,E09000001,NaN,NaN,1232198.045,761574.8873,E12000007
3310,01/07/2019,City of London,E09000001,NaN,NaN,1232198.045,742861.5507,E12000007
3311,01/08/2019,City of London,E09000001,NaN,NaN,1232198.045,797429.3525,E12000007

In [212]:
app2.isnull().sum()

Date           0
Area           0
Code           0
Detached      36
Semi          36
Terraced       0
Flat           0
RegionCode     0
dtype: int64